constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       159400;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          400;
        startFace       159800;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       160200;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       160400;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       160600;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          80000;
        startFace       240600;
    }
)

// ************************************************************************* //
